Universo/app/views/aliens/_form.html.erb

    <%= f.label :planet %>
    <%= collection_select(:alien, :planet_id, Planet.all, :id, :name) %>
---
SELECT "planets".* FROM "planets"

    <%= f.label :power %>
    <%= collection_check_boxes(:alien, :power_ids, Power.all, :id, :name) %>
---
SELECT "powers".* FROM "powers"